Revit 2026 API

# StructuralAssetMetalThermallyTreated Property

---

Flag indicating whether the asset describes a material that is thermally treated or not.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool MetalThermallyTreated { get; set; }
```
```vb
Public Property MetalThermallyTreated As Boolean
	Get
	Set
```
```cpp
public:
property bool MetalThermallyTreated {
	bool get ();
	void set (bool value);
}
```
```fsharp
member MetalThermallyTreated : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InapplicableDataException | When setting this property: the material type must be Metal to set this property. |

Applies to Metal-based structural assets.

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace